#Модули пакеты, внешние зависимости / git clone, добавление участников в репозиторий.
# from название файла import что нужно импортировать
# __init__ файл используется для создания пакетов ( в старых версиях обязательно)
#  в __all __ можно хранить функции и тд что упрощает импорт в другие файлы
# pip - пакетный менеджер пайтон. команда install позволяет скачать библиотеки, фреймворки и другие модули
# pip freeze и pip list позволяют посмотреть что установлено в виртуалке
# виртуалка venv - это директория которая хранить в себе python и установленные модули (библиотеки, фреймворки)
# pip install virtualenv | python venv -m my_venv | venv\Scripts\activate

